backend/controllers/OrdersController.php

    protected function findModel($id)
    {
        if (($model = Orders::findOne($id)) !== null) {
---
SELECT * FROM `orders` WHERE `id`='1'