backend/views/user/index.php

SELECT `name`, `id` FROM `userstatus` ORDER BY `position`
---
            [
            'attribute'=>'status',
            'value'=>'status0.name',
            'filter'=>Userstatus::find()
            		  ->select(['name','id'])
            		  ->orderBy('position')
            		  ->indexBy('id')
            		  ->column(),