common/models/Admin.php

SELECT * FROM `admin` WHERE `id`='1'
---
	public static function findIdentity($id)
    {
    	return static::findOne(['id' => $id]);