common/models/User.php

    public static function getPengdingUserstatusCount()
    {
    	return User::find()->where(['status'=>1])->count();
---
SELECT COUNT(*) FROM `user` WHERE `status`=1