backend/views/drug/index.php

SELECT `is_del`, `id` FROM `drug_is_del` ORDER BY `position`
---
            'drugname',
            ['attribute'=>'is_delid',
            'value'=>'isDel.is_del',
            'filter'=>Drugisdel::find()
            		->select(['is_del','id'])
            		->orderBy('position')
            		->indexBy('id')
            		->column(),